app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
---
SELECT "products".* FROM "products"

  def create

    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "ef"], ["description", "ef"], ["image_url", "ff"], ["created_at", "2017-11-19 10:40:29.534520"], ["updated_at", "2017-11-19 10:40:29.534520"], ["colour", "ef"], ["price", 3.0]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "sdslkd"], ["description", "sdnnnnnnnnnnnnnnnnnnnndwsd"], ["image_url", "wddenjedbenj"], ["updated_at", "2017-11-19 09:59:53.399997"], ["id", 2]]